{
  "backend/main.mo": "Motoko actor storing payment entries and party master records with create, import, list, and lookup functions.",
  "feature_evidence.json": "Feature-to-file mapping report listing frontend code involved in export, print, filtering, and sorting features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend components and utilities.",
  "frontend/index.css": "Tailwind base styles and design tokens plus dark mode variables.",
  "frontend/index.html": "HTML entry point mounting the React application.",
  "frontend/src/App.tsx": "Main React layout with tab navigation for entry, entries, and report views.",
  "frontend/src/features/partyPayments/dueToday.ts": "Utility functions for checking if a payment is due today and formatting phone numbers.",
  "frontend/src/features/partyPayments/partyMastersExcelImport.ts": "Parses Excel files to import party master data, mapping columns and handling warnings and errors.",
  "frontend/src/features/partyPayments/partyMastersStorage.ts": "Manages saving and loading party master records in localStorage with helper lookup utilities.",
  "frontend/src/features/partyPayments/PartyNameCombobox.tsx": "Searchable popover combobox for selecting or typing party names with auto-select behavior.",
  "frontend/src/features/partyPayments/PartyPaymentEntriesView.tsx": "Entries table with search, due-today filter, sorting, and CSV export; loads entries via React Query.",
  "frontend/src/features/partyPayments/PartyPaymentEntryForm.tsx": "Form component for creating party payment entries with location capture, validation, and Excel import of party masters.",
  "frontend/src/features/partyPayments/PartyPaymentReportView.tsx": "Displays party payment history with filtering and supports PDF, CSV, and print export options.",
  "frontend/src/features/partyPayments/partyPaymentsApi.ts": "React Query hooks for CRUD operations on payment entries and party masters, including serialization logic.",
  "frontend/src/features/partyPayments/reportExport/csvExport.ts": "Exports payment entry data to a CSV file with proper escaping and formatting.",
  "frontend/src/features/partyPayments/reportExport/pdfExport.ts": "Generates a PDF payment report using jsPDF and autotable loaded dynamically from CDN.",
  "frontend/src/features/partyPayments/types.ts": "Type definitions for party payment forms, entries, and master records.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, dark mode colors, and print-specific styling rules.",
  "frontend/src/jspdf.d.ts": "Empty TypeScript declaration stub for jspdf.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/xlsx.d.ts": "TypeScript declarations for the xlsx module including workbook, worksheet, utils, and read/write functions.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, container settings, and plugin integrations.",
  "project_state.json": "Project metadata describing current state, features, requirements, and planned functionality."
}