{
  "backend/main.mo": "Motoko canister implementing access-controlled user management, party master records, and CRUD operations for party payment entries.",
  "backend/migration.mo": "Placeholder migration module returning an empty new actor with no migration logic.",
  "feature_evidence.json": "Feature evidence report mapping features to their related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of key frontend files and their responsibilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global background/foreground styling.",
  "frontend/index.html": "HTML entry point that forces light mode before React loads and mounts the root app container.",
  "frontend/src/App.tsx": "Main React app wrapped in AuthGate with tab navigation for entry, listing, and reports, plus a header and footer.",
  "frontend/src/features/auth/AccountSummaryBar.tsx": "User account dropdown showing initials, profile info, and a sign‑out action using Internet Identity hooks.",
  "frontend/src/features/auth/authApi.ts": "React Query hooks for fetching user profile and role, checking admin status, and mutating registration and profile data.",
  "frontend/src/features/auth/AuthGate.tsx": "Auth wrapper determining whether to show login, registration, loading states, or the main app based on identity and user data.",
  "frontend/src/features/auth/LoginScreen.tsx": "Login screen UI that triggers Internet Identity authentication and displays biometric info and errors.",
  "frontend/src/features/auth/RegistrationScreen.tsx": "User registration flow managing steps for account creation, profile setup, and completion with error handling.",
  "frontend/src/features/partyPayments/components/ActorConnectionNotice.tsx": "Shows a loading alert with a spinner while the backend actor initializes.",
  "frontend/src/features/partyPayments/components/PartyPaymentEntryDeleteConfirm.tsx": "Provides a confirmation dialog for deleting a payment entry with a loading state.",
  "frontend/src/features/partyPayments/components/PartyPaymentEntryEditDialog.tsx": "Displays a dialog containing a form for editing an existing payment entry.",
  "frontend/src/features/partyPayments/components/safeErrorMessage.ts": "Generates a sanitized, user‑friendly error message by redacting sensitive data.",
  "frontend/src/features/partyPayments/dueToday.ts": "Utility functions for checking if a payment is due today and formatting phone numbers.",
  "frontend/src/features/partyPayments/partyMastersExcelImport.ts": "Parses Excel files into PartyMaster records with header normalization and warnings.",
  "frontend/src/features/partyPayments/partyMastersStorage.ts": "Handles localStorage persistence and lookup utilities for PartyMaster records.",
  "frontend/src/features/partyPayments/PartyNameCombobox.tsx": "Combobox for selecting or typing party names with search, sorting, and party selection callbacks.",
  "frontend/src/features/partyPayments/PartyPaymentEntriesView.tsx": "Displays, filters, sorts, edits, deletes, and exports party payment entries with actor connection handling.",
  "frontend/src/features/partyPayments/PartyPaymentEntryForm.tsx": "Form for creating or editing payment entries, supporting party master import, geolocation, validation, and success states.",
  "frontend/src/features/partyPayments/PartyPaymentReportView.tsx": "Renders the party payment report UI with filtering, printing, and CSV/PDF export options.",
  "frontend/src/features/partyPayments/partyPaymentsApi.ts": "Defines React Query hooks for CRUD operations on payment entries and party masters using the backend actor.",
  "frontend/src/features/partyPayments/reportExport/csvExport.ts": "Exports payment entries to a downloadable CSV file with proper cell escaping.",
  "frontend/src/features/partyPayments/reportExport/pdfExport.ts": "Generates a payment report PDF using dynamically loaded jsPDF and autotable, formatting entries into a styled table with headers and footers.",
  "frontend/src/features/partyPayments/types.ts": "Defines TypeScript interfaces for party payment form data, entries with metadata, and party master records.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, loading identities, and handling login state.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, CSS variables for themes, and print-specific styling rules.",
  "frontend/src/jspdf.d.ts": "Placeholder TypeScript declaration file for jsPDF.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the main App component.",
  "frontend/src/theme/forceLightMode.ts": "Utility that removes and prevents re-adding the dark class to enforce light mode via MutationObserver.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, clearing, and manipulating URL and session-stored parameters.",
  "frontend/src/xlsx.d.ts": "TypeScript declarations for the xlsx library, describing workbook, worksheet, parsing, and writing utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, dark mode, container settings, extended fonts, colors, radii, shadows, and animations with several plugins.",
  "project_state.json": "Project state describing new authentication, authorization, and biometric login requirements, including known issues and pending feature requests."
}