{
  "kind": "build_request",
  "title": "Add user registration, role/permission management, login UI, and biometric-friendly authentication via Internet Identity",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a user account concept on the backend where an authenticated principal can be registered as an application user, and entry/profile APIs authorize based on that user permission.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "create user and permission for this and login page and biomaetric"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a shared method that lets the authenticated caller register themselves as an app user (idempotent).",
        "After registration, the caller has the required permission to call getAllEntries/createEntry/updateEntry/deleteEntry and getCallerUserProfile/saveCallerUserProfile without Unauthorized traps.",
        "Unauthenticated/anonymous callers still cannot call protected entry/profile APIs and receive an Unauthorized trap."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add admin-only backend APIs to manage user permissions/roles for principals (at minimum: grant and revoke the “user” permission; optionally list registered users).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "create user and permission for this and login page and biomaetric"
        ]
      },
      "acceptanceCriteria": [
        "Only admins can grant/revoke permissions for another principal; non-admin attempts trap with an Unauthorized message.",
        "Admin can grant “user” permission to a specified principal and the change takes effect immediately for authorization checks.",
        "Admin can revoke “user” permission from a specified principal and protected APIs deny access afterward."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a dedicated frontend login/unauthorized gating flow: if the user is not authenticated with Internet Identity, show a login screen; if authenticated but not registered/authorized yet, show a lightweight registration screen; otherwise show the existing app tabs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "create user and permission for this and login page and biomaetric"
        ]
      },
      "acceptanceCriteria": [
        "When no Internet Identity session is present, the main app tabs are not shown; a login page is shown with a clear call-to-action to sign in.",
        "After successful Internet Identity login, if backend authorization indicates the user is not yet an app user, the UI prompts for registration and can complete registration without manual URL tokens.",
        "After registration completes successfully, the existing app UI (tabs: New Entry / All Entries / Report) is shown and entry CRUD queries no longer fail due to missing permission.",
        "A logout control is available and returns the UI to the login page."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add “biometric” support to the login experience by using Internet Identity in a way that supports passkeys/biometric unlock on compatible devices, and reflect this in the UI copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "create user and permission for this and login page and biomaetric"
        ]
      },
      "acceptanceCriteria": [
        "Login UI uses the existing Internet Identity login mechanism (no custom password storage).",
        "User-facing text on the login screen explicitly indicates that device passkeys/biometrics may be used when supported (English text).",
        "No backend changes are required specifically to process biometric data (no biometric templates are stored or transmitted by the app)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a consistent, performance-minded visual theme to the new auth pages (login/registration) and any new navigation elements (e.g., logout/account summary) without changing the core product features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "create user and permission for this and login page and biomaetric"
        ]
      },
      "acceptanceCriteria": [
        "Login and registration screens use a cohesive theme (colors, typography, spacing) consistent with the rest of the app.",
        "Theme avoids default-looking styling and does not rely on a blue/purple palette.",
        "UI remains responsive and fast (no unnecessary heavy animations or large assets added for the auth screens)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend immutablePaths (compose existing hooks/components instead), specifically do not modify frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts.",
    "Authentication must use Internet Identity (no third-party auth providers, no password-based auth, and no external databases).",
    "Do not store or transmit biometric secrets/templates; biometric behavior must be provided by the user agent/Internet Identity/passkeys.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing real-time features (e.g., WebSockets) related to auth or permissions.",
    "Integrating external identity providers or social logins.",
    "Building a custom biometric authentication system independent of Internet Identity.",
    "Changing unrelated party payment features beyond what is necessary to gate access behind login/permissions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}