{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend auth gating with Internet Identity login, registration, and biometric-friendly copy",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Gate the existing tabbed app behind an Internet Identity login screen and a post-login registration/authorization screen, including logout.",
      "acceptanceCriteria": [
        "When no Internet Identity session is present, the main app tabs are not shown; a login page is shown with a clear call-to-action to sign in.",
        "After successful Internet Identity login, if backend authorization indicates the user is not yet an app user, the UI prompts for registration and can complete registration without manual URL tokens.",
        "After registration completes successfully, the existing app UI (tabs: New Entry / All Entries / Report) is shown and entry CRUD queries no longer fail due to missing permission.",
        "A logout control is available and returns the UI to the login page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/auth/authApi.ts",
          "operation": "create",
          "description": "Create React Query hooks around existing backend capabilities needed for the auth flow (e.g., getCallerUserRole, getCallerUserProfile, registerUser, saveCallerUserProfile, isCallerAdmin). Ensure Unauthorized traps are handled gracefully using the existing safeErrorMessage helper. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/AuthGate.tsx",
          "operation": "create",
          "description": "Create an AuthGate component that decides between: (1) LoginScreen when no Internet Identity identity is present, (2) RegistrationScreen when authenticated but role/profile indicates not yet registered/authorized, and (3) rendering children (the existing tab UI) when authorized. Use useInternetIdentity and useActor without modifying them; rely on authApi hooks for role/profile state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/LoginScreen.tsx",
          "operation": "create",
          "description": "Create a dedicated login screen that calls useInternetIdentity().login on user interaction, shows loading/error state, and does not render app tabs. Use existing shadcn-ui primitives already in the project (e.g., buttons/cards/alerts) to match existing UI patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/RegistrationScreen.tsx",
          "operation": "create",
          "description": "Create a lightweight registration screen shown after II login when the caller is not yet an app user. Provide a primary action that triggers registerUser and (if needed) prompts for and saves a display name via saveCallerUserProfile. Show clear success/failure UI and refresh relevant React Query caches so the app transitions into the existing tabs automatically. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/AccountSummaryBar.tsx",
          "operation": "create",
          "description": "Add a small account/logout UI element that can be displayed when authenticated (e.g., showing the caller’s saved profile name if available) and provides a logout button that calls useInternetIdentity().clear and clears the React Query cache. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new AuthGate into the root UI so the existing tabbed experience is only shown when authenticated and registered/authorized. Integrate AccountSummaryBar into the existing header area for authenticated users, and ensure logout returns to the login screen. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make the login experience biometric-friendly by relying on Internet Identity (passkeys/biometric unlock where available) and reflecting this in English UI copy.",
      "acceptanceCriteria": [
        "Login UI uses the existing Internet Identity login mechanism (no custom password storage).",
        "User-facing text on the login screen explicitly indicates that device passkeys/biometrics may be used when supported (English text).",
        "No backend changes are required specifically to process biometric data (no biometric templates are stored or transmitted by the app)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/auth/LoginScreen.tsx",
          "operation": "modify",
          "description": "Add explicit English copy indicating that sign-in uses Internet Identity and may use device passkeys/biometrics on supported devices (without implying the app stores/transmits biometric data). Keep the sign-in action calling the existing useInternetIdentity().login. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply a cohesive, performance-minded visual theme to the auth pages and new navigation elements without changing core product features.",
      "acceptanceCriteria": [
        "Login and registration screens use a cohesive theme (colors, typography, spacing) consistent with the rest of the app.",
        "Theme avoids default-looking styling and does not rely on a blue/purple palette.",
        "UI remains responsive and fast (no unnecessary heavy animations or large assets added for the auth screens)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal, reusable Tailwind/CSS utility patterns (using the existing OKLCH variable-based palette) to style auth layouts (e.g., consistent page padding, card containers, muted backgrounds) while avoiding blue/purple-focused styling and heavy visual effects. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/LoginScreen.tsx",
          "operation": "modify",
          "description": "Align layout/spacing/typography with the app’s existing look (header/body text hierarchy, container widths) and use existing shadcn-ui patterns present in the project for a cohesive appearance without adding heavy assets or animations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/RegistrationScreen.tsx",
          "operation": "modify",
          "description": "Apply the same cohesive theme as LoginScreen and ensure the registration UI is lightweight and responsive, with clear primary/secondary actions and fast perceived performance. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/auth/AccountSummaryBar.tsx",
          "operation": "modify",
          "description": "Style the authenticated account/logout control to match the existing header design (subtle, compact, consistent colors/typography) and avoid introducing new heavy UI behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}